cht_reference/copiedTemplate/system/decomposeParDict
FoamFile 
{ 
	version 2.0; 
	format ascii; 
	class dictionary; 
	object decomposeParDict; 
}

numberOfSubdomains 8;
method hierarchical;

hierarchicalCoeffs
{
    n       (4 2 1); // 2 * 2 * 1 = 4 cores
    delta   0.001;
    order   xyz;
}
